# Toronto Neighbourhood Employment Data
## Extraction of Employment Data from wellbeing toronto economic csv file from www.toronto.ca

In [1]:
import pandas as pd

In [2]:
#!conda update -n base -c defaults conda --yes

In [3]:
#!conda install -c anaconda xlrd --yes

In [4]:
WB_df = pd.read_csv(r'wellbeing_toronto_2016_economicsOriginal.csv')
WB_df.head()

,Neighbourhood,Neighbourhood Id,Businesses,Child Care Spaces,Debt Risk Score,Home Prices,Local Employment,Social Assistance Recipients
0,West Humber-Clairville,1,2463,195,719,317508,58271,2912
1,Mount Olive-Silverstone-Jamestown,2,271,60,687,251119,3244,6561
2,Thistletown-Beaumond Heights,3,217,25,718,414216,1311,1276
3,Rexdale-Kipling,4,144,75,721,392271,1178,1323
4,Elms-Old Rexdale,5,67,60,692,233832,903,1683

In [5]:
# Spliting the Neighbourhood names by '-' & '/' to remove old names or alternate names of neighbourhoods

lt=[]
k = WB_df['Neighbourhood'].str.split('-|/')

k[:][0]
for itr,v in enumerate(k):
    #print(itr)
    #print(v[0])
    lt.append(v[0].strip())
   
    #k.str.replace('West', '')

EMP=pd.DataFrame(lt, columns=['Neighbourhood'])
EMP.head()

  Neighbourhood
0   West Humber
1   Mount Olive
2   Thistletown
3       Rexdale
4          Elms

In [6]:
# Following shows that there are 140 neighbourhoods in toronto
EMP.shape

(140, 1)

In [7]:
# copying the data of employment converting the name of column
EMP['Employment'] = WB_df['Local Employment']

In [8]:
EMP.head()

  Neighbourhood  Employment
0   West Humber       58271
1   Mount Olive        3244
2   Thistletown        1311
3       Rexdale        1178
4          Elms         903

### The open data of Employment in Toronto available is upto 2016 where other data in this project is upto date, therefore for consistancy, employment in each neighbourhood is approximated with available employment growth rate

### The growth rate of Employment in Toronto from the year 2016 till present(2019) is 9.0 approx. 

### For year 2016 employment growth rate ---> 1.2 %
### For year 2017 employment growth rate ---> 3.9 %
### For year 2018 employment growth rate ---> 1.8 %
### Therefore approximating the employment, for consistancy it is converted

In [9]:
### Rounding off to two digits
EMP['Employment'] = round(EMP['Employment']+(EMP['Employment']*6.9/100), 2)
EMP

           Neighbourhood  Employment
0            West Humber    62291.70
1            Mount Olive     3467.84
2            Thistletown     1401.46
3                Rexdale     1259.28
4                   Elms      965.31
..                   ...         ...
135            West Hill     4810.50
136               Woburn    17307.11
137        Eglinton East     2513.22
138  Scarborough Village     1978.72
139            Guildwood      987.76

[140 rows x 2 columns]

In [10]:
EMP['Neighbourhood'] = EMP['Neighbourhood'].str.replace('The', '')
EMP['Neighbourhood'] = EMP['Neighbourhood'].str.replace('North', '')
EMP['Neighbourhood'] = EMP['Neighbourhood'].str.replace('South', '')
EMP['Neighbourhood'] = EMP['Neighbourhood'].str.replace('East', '')
EMP['Neighbourhood'] = EMP['Neighbourhood'].str.replace('West', '')
EMP['Neighbourhood'] = [tmp.strip() for tmp in EMP['Neighbourhood']]

In [12]:
EMP.head()

  Neighbourhood  Employment
0        Humber    62291.70
1   Mount Olive     3467.84
2   Thistletown     1401.46
3       Rexdale     1259.28
4          Elms      965.31

In [13]:
EMP['Employment'].dtype

dtype('float64')

In [14]:
EMP.to_csv('CS_EmploymentData.csv', index=False)